Reports/НалогНаПрибыль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Report>
		<Properties>
			<Name>НалогНаПрибыль</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Консолидированный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВПроводку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/НалогНаПрибыль/Ext/ObjectModule.bsl
Функция Приложение1_Получить(ПолучитьСтроку = Ложь, Стр = "") Экспорт
	
	Строки = Новый Структура;
	
	Строки.Вставить("а010", 0);
	Строки.Вставить("а020", 0);
	Строки.Вставить("а030", 0);
	Строки.Вставить("а040", 0);
	Строки.Вставить("а050", 0);
	Строки.Вставить("а060", 0);
	Строки.Вставить("а070", 0);
	Строки.Вставить("а080", 0);
	Строки.Вставить("а090", 0);
	Строки.Вставить("а100", 0);
	Строки.Вставить("а110", 0);
	Строки.Вставить("а120", 0);
	Строки.Вставить("а130", 0);
	Строки.Вставить("а140", 0);
	Строки.Вставить("а150", 0);
	Строки.Вставить("а160", 0);
	Строки.Вставить("а170", 0);
	Строки.Вставить("а180", 0);
	Строки.Вставить("а190", 0);
	Строки.Вставить("а200", 0);
	Строки.Вставить("а210", 0);
	Строки.Вставить("а220", 0);
	Строки.Вставить("а230", 0);
	Строки.Вставить("а240", 0);
	Строки.Вставить("а250", 0);
	Строки.Вставить("а260", 0);
	Строки.Вставить("а270", 0);
	Строки.Вставить("а280", 0);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0) КАК СуммаОборотДт,
	               |	ХозрасчетныйОбороты.Субконто1.ГрафаПриложения1 КАК Субконто1
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(
	               |			&НП,
	               |			&КП,
	               |			,
	               |			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.А2000)),
	               |			&СтатьиЗатрат,
	               |			ВЫБОР
	               |					КОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ Организация = &Организация
	               |				КОНЕЦ
	               |				И Субконто1.ВозвращатьВНОБДляНалогаНаПрибыль,
	               |			,
	               |			) КАК ХозрасчетныйОбороты
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0),
	               |	ХозрасчетныйОбороты.Субконто1.ГрафаПриложения1
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(
	               |			&НП,
	               |			&КП,
	               |			,
	               |			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.А9400)),
	               |			&РасходыПериода,
	               |			ВЫБОР
	               |					КОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ Организация = &Организация
	               |				КОНЕЦ
	               |				И Субконто1.ВозвращатьВНОБДляНалогаНаПрибыль,
	               |			,
	               |			) КАК ХозрасчетныйОбороты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВТ.СуммаОборотДт) КАК СуммаОборотДт,
	               |	ВТ.Субконто1
	               |ИЗ
	               |	ВТ КАК ВТ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ.Субконто1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ";
	
	Запрос.УстановитьПараметр("НП", НачалоПериода);
	Запрос.УстановитьПараметр("КП", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтатьиЗатрат", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
	Запрос.УстановитьПараметр("РасходыПериода", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РасходыПериода);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Код=Строка(Выборка.Субконто1);
		Код=Лев(Код,Найти(Код," ")-1);
		
		Строки["а"+СокрЛП(Код)] = Выборка.СуммаОборотДт;
		Строки.а010 = Строки.а010 + Выборка.СуммаОборотДт;
		
	КонецЦикла;       	 
	
	Если ПолучитьСтроку Тогда
		Возврат Строки[Стр];	
	Иначе
		Возврат Строки;
	КонецЕсли;         	
	
КонецФункции

Функция Приложение5_Получить(ПолучитьСтроку = Ложь, Стр = "") Экспорт
	
	Строки = Новый Структура;
	
	Строки.Вставить("а010", 0);
	Строки.Вставить("а020", 0);
	Строки.Вставить("а0201", 0);
	Строки.Вставить("а0202", 0);
	Строки.Вставить("а0203", 0);
	Строки.Вставить("а0204", 0);
	Строки.Вставить("а0205", 0);
	Строки.Вставить("а030", 0);
	Строки.Вставить("а0301", 0);
	Строки.Вставить("а0302", 0);
	Строки.Вставить("а0303", 0);
	Строки.Вставить("а0304", 0);
	Строки.Вставить("а0305", 0);
	Строки.Вставить("а040", 0);
	Строки.Вставить("а050", 0);
	
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0) КАК СуммаОборотДт,
	               |	ХозрасчетныйОбороты.Субконто1.ГрафаПриложения5 КАК Субконто1
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(
	               |			&НП,
	               |			&КП,
	               |			,
	               |			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.А2000)),
	               |			&СтатьиЗатрат,
	               |			ВЫБОР
	               |					КОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ Организация = &Организация
	               |				КОНЕЦ
	               |				И Субконто1.Приложение5,
	               |			,
	               |			) КАК ХозрасчетныйОбороты
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ХозрасчетныйОбороты.СуммаОборотДт, 0),
	               |	ХозрасчетныйОбороты.Субконто1.ГрафаПриложения5
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(
	               |			&НП,
	               |			&КП,
	               |			,
	               |			Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.А9400)),
	               |			&РасходыПериода,
	               |			ВЫБОР
	               |					КОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |						ТОГДА ИСТИНА
	               |					ИНАЧЕ Организация = &Организация
	               |				КОНЕЦ
	               |				И Субконто1.Приложение5,
	               |			,
	               |			) КАК ХозрасчетныйОбороты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(ВТ.СуммаОборотДт) КАК СуммаОборотДт,
	               |	ВТ.Субконто1
	               |ИЗ
	               |	ВТ КАК ВТ
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ.Субконто1
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ";
	
	Запрос.УстановитьПараметр("НП", НачалоПериода);
	Запрос.УстановитьПараметр("КП", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтатьиЗатрат", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
	Запрос.УстановитьПараметр("РасходыПериода", ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РасходыПериода);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Код=Строка(Выборка.Субконто1);
		Код=Лев(Код,Найти(Код," ")-1);
		
		Строки["а"+СокрЛП(Код)] = Выборка.СуммаОборотДт;
		Строки.а010 = Строки.а010 + Выборка.СуммаОборотДт;
		
	КонецЦикла;       	 
	
	Строки.а020 = Строки.а0201 + Строки.а0202 + Строки.а0203 + Строки.а0204 + Строки.а0205;
	Строки.а030 = Строки.а0301 + Строки.а0302 + Строки.а0303 + Строки.а0304 + Строки.а0305;
	Строки.а010 = Строки.а020 + Строки.а030;
	
	Если ПолучитьСтроку Тогда
		Возврат Строки[Стр];	
	Иначе
		Возврат Строки;
	КонецЕсли;         	
	
КонецФункции

Функция Приложение10_Получить(ПолучитьСтроку = Ложь, Стр = "") Экспорт
	
	Строки = Новый Структура;
	
	а010 = 0;
	а020 = 0;
	а030 = 0;
	а040 = 0;
	а050 = 0;
	а060 = 0;
	
	а010 = НалоговаяОтчетность.РассчитатьОбъемВыполненныхРаботЗаПериод(Организация,НачалоГода(НачалоПериода),КонецПериода);
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	ХозрасчетныйОбороты.Субконто1 КАК Субконто1,
	//			   |	ХозрасчетныйОбороты.Субконто2 КАК Субконто2,
	//			   |	СУММА(ХозрасчетныйОбороты.СуммаОборотКт) КАК Сумма
	//			   |ИЗ
	//			   |	РегистрБухгалтерии.Хозрасчетный.Обороты(
	//			   |			&НП,
	//			   |			&КП,
	//			   |			,
	//			   |			Счет В иерархии (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.А9000)),
	//			   |			,
	//			   |			ВЫБОР
	//			   |				КОГДА &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	//			   |					ТОГДА ИСТИНА
	//			   |				ИНАЧЕ Организация = &Организация
	//			   |			КОНЕЦ,
	//			   |			,
	//			   |			) КАК ХозрасчетныйОбороты
	//			   |
	//			   |СГРУППИРОВАТЬ ПО
	//			   |	ХозрасчетныйОбороты.Субконто1,
	//			   |	ХозрасчетныйОбороты.Субконто2
	//			   |
	//			   |УПОРЯДОЧИТЬ ПО
	//			   |	Субконто1,
	//			   |	Субконто2";
	//
	//Запрос.УстановитьПараметр("НП", НачалоГода(НачалоПериода));
	//Запрос.УстановитьПараметр("КП", КонецМесяца(КонецПериода));
	//Запрос.УстановитьПараметр("Организация", Организация); 
	//
	//Результат = Запрос.Выполнить();
	//Выборка = Результат.Выбрать();
	//
	//Если Выборка.Следующий() Тогда
	//	а020 = Выборка.Сумма;
	//КонецЕсли;	
	
	а020=0;
	
	а030 = а020;
	
	а040 = а020*100/а010;
	
	а050 = Ставка;
	
	Если (а040 >= 15)И(а040 < 30) Тогда
		а060 = а050 - а050*0.3;
	ИначеЕсли а040 >= 30 Тогда
		а060 = а050*0.5;
	КонецЕсли; 
	
	Строки.Вставить("а010", а010);
	Строки.Вставить("а020", а020);
	Строки.Вставить("а030", а030);
	Строки.Вставить("а040", а040);
	Строки.Вставить("а050", а050);
	Строки.Вставить("а060", а060);

	
	Если ПолучитьСтроку Тогда
		Возврат Строки[Стр];	
	Иначе
		Возврат Строки;
	КонецЕсли;         	
	
КонецФункции
